In [30]:
import pandas as pd ## 引入pandas

#  读取数据

In [31]:
df = pd.read_excel('team.xlsx') ## pd.read_csv() 支持对csv文件读取，另外也支持许多其他类型的文件。

In [32]:
df

        name team  Q1  Q2  Q3  Q4
0      Liver    E  89  21  24  64
1       Arry    C  36  37  37  57
2        Ack    A  57  60  18  84
3      Eorge    C  93  96  71  78
4        Oah    D  65  49  61  86
..       ...  ...  ..  ..  ..  ..
95   Gabriel    C  48  59  87  74
96   Austin7    C  21  31  30  43
97  Lincoln4    C  98  93   1  20
98       Eli    E  11  74  58  91
99       Ben    E  21  43  41  74

[100 rows x 6 columns]

# 查看数据

In [33]:
df.head() ## 查看头部数据
df.tail() ## 查看尾部数据
df.sample(5) ## 随机查看5条数据

       name team  Q1  Q2  Q3  Q4
82     Finn    E   4   1  55  32
2       Ack    A  57  60  18  84
43     Jude    E   8  45  13  65
77  Michael    B  89  21  59  92
11    Logan    B   9  89  35  65

# 检验数据

In [34]:
df.shape # 查看行数和列数

(100, 6)

In [35]:
df.info() # 查看索引、数据类型和内存信息

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    100 non-null    object
 1   team    100 non-null    object
 2   Q1      100 non-null    int64
 3   Q2      100 non-null    int64
 4   Q3      100 non-null    int64
 5   Q4      100 non-null    int64
dtypes: int64(4), object(2)
memory usage: 4.8+ KB

In [36]:
df.describe() # 查看数值类型列的汇总统计

               Q1          Q2          Q3          Q4
count  100.000000  100.000000  100.000000  100.000000
mean    49.200000   52.550000   52.670000   52.780000
std     29.962603   29.845181   26.543677   27.818524
min      1.000000    1.000000    1.000000    2.000000
25%     19.500000   26.750000   29.500000   29.500000
50%     51.500000   49.500000   55.000000   53.000000
75%     74.250000   77.750000   76.250000   75.250000
max     98.000000   99.000000   99.000000   99.000000

mean 数据均值
count 数据数量
std 标准差
min 最小值
max 最大值
% 四分位数

In [37]:
df.dtypes # 查看各字段类型

name    object
team    object
Q1       int64
Q2       int64
Q3       int64
Q4       int64
dtype: object

In [38]:
df.axes # 显示数据函数和列名

[RangeIndex(start=0, stop=100, step=1),
 Index(['name', 'team', 'Q1', 'Q2', 'Q3', 'Q4'], dtype='object')]

In [39]:
df.columns # 列名

Index(['name', 'team', 'Q1', 'Q2', 'Q3', 'Q4'], dtype='object')

# 设置索引，即对主要关键字建立索引

In [40]:
df.set_index('name', inplace=True) # 建立索引后表的变化

In [42]:
df.head() # 已经将name作为行名。

      team  Q1  Q2  Q3  Q4
name
Liver    E  89  21  24  64
Arry     C  36  37  37  57
Ack      A  57  60  18  84
Eorge    C  93  96  71  78
Oah      D  65  49  61  86

# 数据选取

In [44]:
# 查看指定列
df['Q1'] ## 或者 df.Q1 只要名字符合命名规则就可以

name
Liver       89
Arry        36
Ack         57
Eorge       93
Oah         65
            ..
Gabriel     48
Austin7     21
Lincoln4    98
Eli         11
Ben         21
Name: Q1, Length: 100, dtype: int64

In [46]:
# 选择多列
df[['team', 'Q1']] # 只看两列，传入列表
# df.loc[:, ['team', 'Q1']] 与上面效果相同。

         team  Q1
name
Liver       E  89
Arry        C  36
Ack         A  57
Eorge       C  93
Oah         D  65
...       ...  ..
Gabriel     C  48
Austin7     C  21
Lincoln4    C  98
Eli         E  11
Ben         E  21

[100 rows x 2 columns]

In [51]:
# 选择行
index = df.index == 'Liver' ## 返回一个索引真值表
df[df.index == 'Liver'] # 通过这个真值表来进行

      team  Q1  Q2  Q3  Q4
name
Liver    E  89  21  24  64

In [54]:
# 自然索引索引选择，类似列表切片
df[0:3] # 取前三行
df[0:10:2] # 0-9 步长：2
df.iloc[:10, :] # 取前10个

       team  Q1  Q2  Q3  Q4
name
Liver     E  89  21  24  64
Arry      C  36  37  37  57
Ack       A  57  60  18  84
Eorge     C  93  96  71  78
Oah       D  65  49  61  86
Harlie    C  24  13  87  43
Acob      B  61  95  94   8
Lfie      A   9  10  99  37
Reddie    D  64  93  57  72
Oscar     A  77   9  26  67

In [57]:
# 指定行和列
df.loc['Ben', 'Q1':'Q4'] # 只看Ben的四个季度成绩
df.loc['Eorge':'Alexander', 'team':'Q4'] # 指定行列区间

          team  Q1  Q2  Q3  Q4
name
Eorge        C  93  96  71  78
Oah          D  65  49  61  86
Harlie       C  24  13  87  43
Acob         B  61  95  94   8
Lfie         A   9  10  99  37
Reddie       D  64  93  57  72
Oscar        A  77   9  26  67
Leo          B  17   4  33  79
Logan        B   9  89  35  65
Archie       C  83  89  59  68
Theo         C  51  86  87  27
Thomas       B  80  48  56  41
James        E  48  77  52  11
Joshua       A  63   4  80  30
Henry        A  91  15  75  17
William      C  80  68   3  26
Max          E  97  75  41   3
Lucas        A  60  41  77  62
Ethan        D  79  45  89  88
Arthur       A  44  53  42  40
Mason        D  80  96  26  49
Isaac        E  74  23  28  65
Harrison     B  89  13  18  75
Teddy        E  71  91  21  48
Finley       D  62  73  84  68
Daniel       C  50  50  72  61
Riley        E  35  26  59  83
Edward       B  57  38  86  87
Joseph       E  67  87  87  93
Alexander    C  91  76  26  79

In [68]:
# 条件查询
## 单一条件
df[df.Q1 > 90] # Q1列大于90的
df[df.team == 'C'] # team列为C的
df[df.index == 'Oscar'] #索引指定值
## 组合条件
df[(df['Q1'] > 90) & (df['team'] == 'C')] # and关系
df[df['team'] == 'C'].loc[df.Q1 > 90] # 多重筛选
# df[df['team'] == 'C'][df.Q1 > 90] # 多重筛选

          team  Q1  Q2  Q3  Q4
name
Eorge        C  93  96  71  78
Alexander    C  91  76  26  79
Lincoln4     C  98  93   1  20

# 排序

In [72]:
df.sort_values(by='Q1') # 按Q1列数据升序排列，默认按升序排列
df.sort_values('Q1', ascending=False) # 降序 
df.sort_values(['team', 'Q1'], ascending=[True, False]) # team升序，Q1降序

         team  Q1  Q2  Q3  Q4
name
Aaron       A  96  75  55   8
Henry       A  91  15  75  17
Nathan      A  87  77  62  13
Dylan       A  86  87  65  20
Blake       A  78  23  93   9
...       ...  ..  ..  ..  ..
Eli         E  11  74  58  91
Jude        E   8  45  13  65
Rory9       E   8  12  58  27
Jackson5    E   6  10  15  33
Finn        E   4   1  55  32

[100 rows x 5 columns]

# 分组聚类

In [75]:
df.groupby('team').sum() # 按团队分组对应列相加
df.groupby('team').mean() # 按团队分组对应列求平均值
## 不同列不同的计算方法
df.groupby('team').agg({ # 都是对组内的操作
	'Q1': sum, # 总和
	'Q2': 'count',
	'Q3': 'mean',
	'Q4': max
})

        Q1  Q2         Q3  Q4
team
A     1066  17  51.470588  97
B      975  22  54.636364  99
C     1056  22  48.545455  98
D      860  19  65.315789  99
E      963  20  44.050000  98